const  MUST_MAP = new Map();//must learn words
const GREEN_MAP = new Map();//green way words

//一年级上册
MUST_MAP.set("一年级上册识字1",  new Array("一", "二", "三", "四", "五", "六", "七", "八", "九", "十"));
MUST_MAP.set("一年级上册识字2",  new Array("万", "千", "百", "小", "个"));
MUST_MAP.set("一年级上册识字3",  new Array("太", "鸟", "下", "早", "牙", "上"));
MUST_MAP.set("一年级上册识字4",  new Array("公", "水", "火", "山", "木", "马"));
MUST_MAP.set("一年级上册识字5",  new Array("采", "田", "林", "花", "牛"));
MUST_MAP.set("一年级上册识字6",  new Array("沙", "贝", "丫", "珍", "鱼"));
MUST_MAP.set("一年级上册识字7",  new Array("羊", "犬", "牧", "竹", "草", "地"));
MUST_MAP.set("一年级上册识字8",  new Array("鸡", "鸭", "鹅", "鸦", "日", "长"));
MUST_MAP.set("一年级上册第1课",  new Array("人", "手", "大", "工", "用", "才"));
MUST_MAP.set("一年级上册第2课",  new Array("天", "白", "云", "儿", "土", "子"));
MUST_MAP.set("一年级上册第3课",  new Array("红", "中", "立", "正", "向"));
MUST_MAP.set("一年级上册第4课",  new Array("雨", "点", "里", "在", "江"));
MUST_MAP.set("一年级上册第5课",  new Array("了", "风", "虫", "月", "方"));
MUST_MAP.set("一年级上册第6课",  new Array("我", "去", "片", "开", "可", "也", "不"));
MUST_MAP.set("一年级上册第7课",  new Array("电", "有", "从", "回", "豆", "年"));
MUST_MAP.set("一年级上册第8课",  new Array("两", "东", "西", "让", "会", "再", "么"));
MUST_MAP.set("一年级上册第9课",  new Array("他", "画", "比", "当", "后", "书"));
MUST_MAP.set("一年级上册第10课", new Array("雪", "头", "好", "放", "到", "多", "乐"));
MUST_MAP.set("一年级上册第11课", new Array("北", "听", "出", "气", "口", "毛", "见"));
MUST_MAP.set("一年级上册第12课", new Array("青", "对", "着", "叫", "分", "干", "更"));

//一年级下册
MUST_MAP.set("一年级下册识字1", new Array("春", "树", "芽", "布", "谷", "梨", "杏", "桃"));
MUST_MAP.set("一年级下册识字2", new Array("足", "台", "倒", "勾", "过", "门", "加"));
MUST_MAP.set("一年级下册识字3", new Array("舟", "石", "泉", "川", "河", "问", "什", "国"));
MUST_MAP.set("一年级下册识字4", new Array("轮", "车", "轨", "载", "转", "美", "京", "海"));
MUST_MAP.set("一年级下册识字5", new Array("星", "爷", "奶", "丁", "扇", "女", "斗"));
MUST_MAP.set("一年级下册识字6", new Array("众", "条", "黄", "变", "金", "单", "丝"));
MUST_MAP.set("一年级下册识字7", new Array("清", "洁", "请", "晴", "情", "睛", "眼", "飞"));
MUST_MAP.set("一年级下册识字8", new Array("铁", "钉", "铜", "铃", "宁", "叮", "吓", "跑"));
MUST_MAP.set("一年级下册第1课", new Array("光", "成", "亮", "起", "的", "阳", "处"));
MUST_MAP.set("一年级下册第2课", new Array("声", "它", "冲", "来", "外", "生", "笑", "节"));
MUST_MAP.set("一年级下册第3课", new Array("叶", "还", "就", "走", "进", "心", "高", "兴"));
MUST_MAP.set("一年级下册第4课", new Array("呀", "先", "是", "乎", "色", "久", "空", "站"));
MUST_MAP.set("一年级下册第5课", new Array("伙", "和", "同", "办", "巴", "皮", "边", "跳"));
MUST_MAP.set("一年级下册第6课", new Array("吃", "学", "发", "力", "包", "样", "几", "少", "饭"));
MUST_MAP.set("一年级下册第7课", new Array("觉", "知", "原", "岁", "尽", "吹"));
MUST_MAP.set("一年级下册第8课", new Array("只", "找", "面", "半", "于", "法", "升"));
MUST_MAP.set("一年级下册第9课", new Array("真", "自", "己", "间", "朵", "无", "与", "首"));
MUST_MAP.set("一年级下册第10课", new Array("司", "古", "时", "候", "别", "哭", "没", "那"));
MUST_MAP.set("一年级下册第11课", new Array("暗", "说", "得", "快", "文", "家", "动"));
MUST_MAP.set("一年级下册第12课", new Array("兄", "弟", "住", "呼", "王", "行"));
MUST_MAP.set("一年级下册第13课", new Array("世", "界", "把", "广", "们", "要", "汽"));
MUST_MAP.set("一年级下册第14课", new Array("习", "作", "休", "你", "每", "闭", "合", "明"));
MUST_MAP.set("一年级下册第15课", new Array("主", "冰", "因", "胖", "羽", "交", "耳", "机"));
MUST_MAP.set("一年级下册第16课", new Array("妈", "身", "扬", "安", "城", "挂", "张"));
MUST_MAP.set("一年级下册第17课", new Array("团", "圆", "宝", "男", "朋", "友", "队", "票"));
MUST_MAP.set("一年级下册第18课", new Array("陈", "母", "元", "床", "衣", "打", "次", "今"));
MUST_MAP.set("一年级下册第19课", new Array("平", "写", "字", "校", "课", "业", "页", "册"));
MUST_MAP.set("一年级下册第20课", new Array("性", "艺", "牢", "全", "响", "给", "位", "道"));
MUST_MAP.set("一年级下册第21课", new Array("松", "果", "很", "冬", "以", "直", "言", "语"));
MUST_MAP.set("一年级下册第22课", new Array("夏", "背", "拉", "汗", "瓜", "由", "洞", "冷"));
MUST_MAP.set("一年级下册第23课", new Array("呢", "答", "话", "被", "伯", "孩"));
MUST_MAP.set("一年级下册第24课", new Array("农", "禾", "午", "辛", "苦", "秋", "闲", "夫", "死"));

//二年级上册
MUST_MAP.set("二年级上册识字1", new Array("蓝", "凉", "银", "远", "戏", "重"));
MUST_MAP.set("二年级上册识字2", new Array("灯", "桥", "检", "陆", "炮", "狂", "欢", "州"));
MUST_MAP.set("二年级上册识字3", new Array("笔", "灶", "尖", "歪", "尾", "看", "炉", "桌"));
MUST_MAP.set("二年级上册识字4", new Array("苗", "描", "猫", "船", "莫", "偏", "旁"));
MUST_MAP.set("二年级上册识字5", new Array("寒", "流", "梅", "翠", "蛇", "刺", "滑"));
MUST_MAP.set("二年级上册识字6", new Array("塞", "骄", "岛"));
MUST_MAP.set("二年级上册识字7", new Array("亭", "停", "闻", "鸣", "步", "深", "但"));
MUST_MAP.set("二年级上册识字8", new Array("饱", "泡", "吐", "嘴"));
MUST_MAP.set("二年级上册第1课", new Array("老", "师", "郊", "玩", "兔", "忙", "奔"));
MUST_MAP.set("二年级上册第2课", new Array("英", "诗", "思", "举", "晚", "层", "念", "谁"));
MUST_MAP.set("二年级上册第3课", new Array("乡", "怀", "唱", "捉", "丽", "含", "曲", "坏"));
MUST_MAP.set("二年级上册第4课", new Array("夕", "已", "经", "芒", "伏", "余", "往", "脸"));
MUST_MAP.set("二年级上册第5课", new Array("送", "婆", "绿", "邻", "居", "替", "童", "忘"));
MUST_MAP.set("二年级上册第6课", new Array("枫", "想", "总", "为", "而", "终", "纸", "卡"));
MUST_MAP.set("二年级上册第7课", new Array("忆", "南", "旧", "如", "阴", "似", "苍", "低"));
MUST_MAP.set("二年级上册第8课", new Array("喊", "算", "简", "奋", "指", "抬", "盘"));
MUST_MAP.set("二年级上册第9课", new Array("座", "吸", "完", "失", "阶", "定", "现"));
MUST_MAP.set("二年级上册第10课", new Array("狼", "故", "弄", "亲", "常", "争", "反", "都"));
MUST_MAP.set("二年级上册第11课", new Array("乌", "肉", "珠", "差", "音", "句", "非", "刚"));
MUST_MAP.set("二年级上册第12课", new Array("席", "延", "贵", "弯", "革", "命", "连"));
MUST_MAP.set("二年级上册第13课", new Array("朱", "井", "军", "必", "产", "穿", "做", "尺", "并"));
MUST_MAP.set("二年级上册第14课", new Array("归", "仔", "细", "引", "入", "共", "父", "代"));
MUST_MAP.set("二年级上册第15课", new Array("孔", "优", "秀", "市", "尼", "印", "医", "血"));
MUST_MAP.set("二年级上册第16课", new Array("房", "及", "厂", "客", "耍", "然", "洗", "汪"));
MUST_MAP.set("二年级上册第17课", new Array("件", "姑", "菊", "晶", "实", "味", "舌"));
MUST_MAP.set("二年级上册第18课", new Array("依", "穷", "目", "返", "景", "照"));
MUST_MAP.set("二年级上册第19课", new Array("灰", "森", "块", "丛", "这", "报", "告"));
MUST_MAP.set("二年级上册第20课", new Array("丹", "黑", "论", "显", "仙", "伴", "之", "度"));
MUST_MAP.set("二年级上册第21课", new Array("左", "右", "寻", "员", "香", "米", "区", "充"));
MUST_MAP.set("二年级上册第22课", new Array("商", "量", "等", "哥", "备", "泥", "妹", "卫"));

//二年级下册
MUST_MAP.set("二年级下册识字1 ", new Array("饺", "拜", "扫", "墓", "踏", "端", "团", "圆", "饼"));
MUST_MAP.set("二年级下册识字2 ", new Array("碧", "峰", "影", "鼻", "骆", "驼", "架", "廊"));
MUST_MAP.set("二年级下册识字3 ", new Array("柏", "杨", "柳", "椅", "秧", "篮", "茶", "菠", "萝"));
MUST_MAP.set("二年级下册识字4 ", new Array("晒", "瞄", "冻"));
MUST_MAP.set("二年级下册识字5 ", new Array("岗", "巡", "航", "导", "弹", "哨"));
MUST_MAP.set("二年级下册识字6 ", new Array("狮", "猴", "猩", "鹿", "斑", "袋"));
MUST_MAP.set("二年级下册识字7 ", new Array("福", "裙", "裤", "衬", "衫", "室", "宅", "庭", "窝", "户"));
MUST_MAP.set("二年级下册识字8 ", new Array("鸦", "杜", "雕", "雁", "朗", "腰", "踢", "腿", "胸"));
MUST_MAP.set("二年级下册第1课 ", new Array("乃", "随", "潜", "润", "细", "晓", "眠"));
MUST_MAP.set("二年级下册第2课 ", new Array("蚕", "姑", "娘", "桑", "旧", "换", "胖", "盖", "响"));
MUST_MAP.set("二年级下册第3课 ", new Array("湾", "绕", "缓", "映", "像", "烂", "朝", "坡"));
MUST_MAP.set("二年级下册第4课 ", new Array("艳", "巾", "贺", "爱", "希", "健", "康", "勇", "敢", "敬"));
MUST_MAP.set("二年级下册第5课 ", new Array("梢", "赤", "劲", "妹", "射", "奋", "短", "粗", "咬"));
MUST_MAP.set("二年级下册第6课 ", new Array("本", "碰", "巧", "脱", "强", "些", "受", "挂", "推"));
MUST_MAP.set("二年级下册第7课 ", new Array("奖", "翅", "膀", "蜻", "蜓", "蜜", "蜂", "怕", "坚", "硬"));
MUST_MAP.set("二年级下册第8课 ", new Array("狐", "假", "虎", "威", "寻", "抗", "胆", "爪", "吓", "借"));
MUST_MAP.set("二年级下册第9课 ", new Array("恩", "补", "针", "根", "抚", "摸", "报", "迟", "寸", "永"));
MUST_MAP.set("二年级下册第10课", new Array("叹", "含", "泪", "良", "因", "为", "恨", "付", "告", "武"));
MUST_MAP.set("二年级下册第11课", new Array("救", "切", "便", "果", "充", "孝", "仙", "败", "凶", "恶"));
MUST_MAP.set("二年级下册第12课", new Array("征", "兵", "父", "病", "弟", "男", "胜", "利", "将"));
MUST_MAP.set("二年级下册第13课", new Array("棋", "围", "能", "专", "致", "另", "鹅", "弓", "箭", "作"));
MUST_MAP.set("二年级下册第14课", new Array("培", "搞", "考", "始", "衣", "计", "备", "粉", "移", "而"));
MUST_MAP.set("二年级下册第15课", new Array("请", "医", "急", "性", "炎", "术", "何", "秒", "挡", "简"));
MUST_MAP.set("二年级下册第16课", new Array("徐", "修", "务", "凡", "内", "供", "具", "按", "纸", "取"));
MUST_MAP.set("二年级下册第17课", new Array("王", "敌", "关", "迷", "顺", "埋", "死", "战", "仇", "扬"));
MUST_MAP.set("二年级下册第18课", new Array("部", "筑", "育", "密", "玉", "拾", "类"));
MUST_MAP.set("二年级下册第19课", new Array("祖", "源", "茂", "季", "丛", "赶", "景", "撒", "批"));
MUST_MAP.set("二年级下册第20课", new Array("泼", "桶", "互", "吉", "祥", "如", "味", "幸", "肯", "离"));
MUST_MAP.set("二年级下册第21课", new Array("热", "透", "游", "眨", "柄", "伞", "着", "戏"));
MUST_MAP.set("二年级下册第22课", new Array("种", "浇", "施", "肥", "耐", "想", "拔", "改", "喜"));
MUST_MAP.set("二年级下册第23课", new Array("路", "晨", "奇", "送", "陪", "趣", "角", "概", "激"));
MUST_MAP.set("二年级下册第24课", new Array("银", "轮", "郎", "相", "拦", "坝", "宇", "宙"));


//三年级下册
MUST_MAP.set("三年级下册第1课",   new Array("驾", "折", "蜒", "谱", "朽", "篇", "创", "族", "绸"));
MUST_MAP.set("三年级下册第2课",   new Array("辽", "阔", "屿", "罗", "库", "资", "仅", "暗", "合", "龟"));
MUST_MAP.set("三年级下册第3课",   new Array("庐", "瀑", "幻", "似", "姿", "笼", "罩", "系", "泻", "返"));
MUST_MAP.set("三年级下册第4课",   new Array("操", "选", "际", "届", "试", "箱", "固", "套", "询", "疗"));
MUST_MAP.set("三年级下册第5课",   new Array("剩", "鸽", "捡", "哀", "悠", "任", "阻", "忠", "递", "盼"));
MUST_MAP.set("三年级下册第6课",   new Array("俯", "摘", "捧", "拿", "措", "惶", "恐", "舍", "惹", "懂"));
MUST_MAP.set("三年级下册第7课",   new Array("藏", "区", "段", "胞", "译", "糊", "涂", "怨", "耕", "播"));
MUST_MAP.set("三年级下册第8课",   new Array("唐", "卢", "组", "期", "逻", "惕", "搭", "猎", "呆", "扎"));
MUST_MAP.set("三年级下册第9课",   new Array("探", "昌", "阁", "督", "宴", "章", "鸭", "读", "序", "  "));
MUST_MAP.set("三年级下册第10课",  new Array("纳", "科", "诉", "豪", "预", "料", "联", "识", "触", "虚"));
MUST_MAP.set("三年级下册第11课",  new Array("支", "暑", "舅", "抓", "逃", "夹", "须", "捏", "俘", "虏"));
MUST_MAP.set("三年级下册第12课",  new Array("挤", "蓬", "骨", "胀", "裂", "幅", "翩", "蹈", "昨", "梦"));
MUST_MAP.set("三年级下册第13课",  new Array("紫", "尺", "疑", "绝"));
MUST_MAP.set("三年级下册第14课",  new Array("镜", "委", "屈", "趟", "亏", "陷", "够", "铺", "闭"));
MUST_MAP.set("三年级下册第15课",  new Array("鸥", "货", "喂", "护", "迅", "速", "援", "佩", "森", "谈"));
MUST_MAP.set("三年级下册第16课",  new Array("盯", "哈", "监", "怒", "厉", "吼", "设", "疯", "牢", "泄"));
MUST_MAP.set("三年级下册第17课",  new Array("垂", "汤", "钓", "钩", "竿", "拖", "未", "允", "规", "毫"));
MUST_MAP.set("三年级下册第18课",  new Array("凯", "葱", "捕", "杀", "其", "饥", "退", "惨", "染", "旦"));
MUST_MAP.set("三年级下册第19课",  new Array("陶", "慈", "舌", "抢", "蝇", "蚊", "握", "据", "构", "复"));
MUST_MAP.set("三年级下册第20课",  new Array("亿", "漫", "吊", "剑", "型", "畏", "猛", "齿", "匕", "谜"));
MUST_MAP.set("三年级下册第21课",  new Array("槐", "肩", "挎", "摆", "顿", "拌", "咸", "蒜", "炒", "芝"));
MUST_MAP.set("三年级下册第22课",  new Array("底", "窃", "私", "汪", "危", "肌", "缩", "途", "旅", "甲"));
MUST_MAP.set("三年级下册第23课",  new Array("漆", "集", "躲", "阿", "剪", "社", "越", "冒", "饿", "雄"));
MUST_MAP.set("三年级下册第24课",  new Array("寓", "则", "宋", "焦", "疲", "勃", "闷", "枯", "弱"));
MUST_MAP.set("三年级下册第25课",  new Array("烤", "辩", "嫩", "评", "剖", "笨", "键", "聚", "赞"));
MUST_MAP.set("三年级下册第26课",  new Array("挥", "舞", "夺", "靠", "熟", "娃", "蛋", "禁", "番"));

/*
 *  Green way words
 */
 //一年级上册
GREEN_MAP.set("一年级上册识字1", new Array("烟", "村", "家", "亭", "台"));
GREEN_MAP.set("一年级上册识字2", new Array("荷", "叶", "朵", "条", "只", "蛙", "唱"));
GREEN_MAP.set("一年级上册识字3", new Array("阳", "钟", "穿", "床", "起", "刷", "洗", "脸"));
GREEN_MAP.set("一年级上册识字4", new Array("园", "绿", "树", "桥", "流", "塔", "转", "椅"));
GREEN_MAP.set("一年级上册识字5", new Array("观", "察", "蚂", "蚁", "蝴", "蝶", "蜻", "蜓"));
GREEN_MAP.set("一年级上册识字6", new Array("滩", "壳", "脚", "浪", "港", "湾", "晚", "霞"));
GREEN_MAP.set("一年级上册识字7", new Array("竿", "啦", "还", "缺", "黑", "你", "吧"));
GREEN_MAP.set("一年级上册识字8", new Array("乌", "成", "熟", "最", "先", "知", "道", "谁"));
GREEN_MAP.set("一年级上册第1课", new Array("宝", "和", "脑", "思", "考", "创", "造"));
GREEN_MAP.set("一年级上册第2课", new Array("是", "的", "河", "泥", "们", "祖", "国"));
GREEN_MAP.set("一年级上册第3课", new Array("旗", "歌", "声", "高", "您", "敬", "礼"));
GREEN_MAP.set("一年级上册第4课", new Array("池", "塘", "睡", "觉", "散", "步", "海", "洋"));
GREEN_MAP.set("一年级上册第5课", new Array("姑", "娘", "她", "凉", "香", "甜", "美", "丽"));
GREEN_MAP.set("一年级上册第6课", new Array("看", "菊", "爸", "妈", "迎", "寒", "都", "很"));
GREEN_MAP.set("一年级上册第7课", new Array("刘", "阿", "姨", "信", "话", "老", "师"));
GREEN_MAP.set("一年级上册第8课", new Array("晶", "过", "碎", "要", "惊", "动", "静", "瞧"));
GREEN_MAP.set("一年级上册第9课", new Array("怀", "素", "写", "唐", "尚", "笔", "顺", "纸"));
GREEN_MAP.set("一年级上册第10课", new Array("枝", "像", "梨", "苗", "盖", "棉", "被", "梦"));
GREEN_MAP.set("一年级上册第11课", new Array("吹", "颜", "色", "躲", "意", "怕", "浮", "捉"));
GREEN_MAP.set("一年级上册第12课", new Array("弯", "满", "眼", "感", "谢", "接", "喜", "给")); 
//一年级下册
GREEN_MAP.set("一年级下册识字1", new Array("柳", "嫩", "蜜", "蜂"));
GREEN_MAP.set("一年级下册识字2", new Array("球", "拼", "抢", "争", "顶", "传", "射", "喊", "油"));
GREEN_MAP.set("一年级下册识字3", new Array("燕", "蜡", "蓝"));
GREEN_MAP.set("一年级下册识字4", new Array("装", "输", "谐", "号", "窗", "景", "贴"));
GREEN_MAP.set("一年级下册识字5", new Array("夜", "繁", "蒲", "萤", "牵", "织"));
GREEN_MAP.set("一年级下册识字6", new Array("跟", "群", "森", "线", "独"));
GREEN_MAP.set("一年级下册识字7", new Array("坐", "事", "蚊"));
GREEN_MAP.set("一年级下册识字8", new Array("钉", "阵", "咚", "狗", "坏"));
GREEN_MAP.set("一年级下册第1课", new Array("晨", "醒", "滴", "落", "睁", "望", "热", "闹"));
GREEN_MAP.set("一年级下册第2课", new Array("笋", "雷", "唤", "破", "掀", "翻", "冒", "浅", "褐", "娃"));
GREEN_MAP.set("一年级下册第3课", new Array("雾", "迷", "蒙", "轻", "摇", "哇", "灵", "露", "眨"));
GREEN_MAP.set("一年级下册第4课", new Array("蹲", "孵", "蛋", "嘴", "啄", "碧", "翅", "膀", "撑"));
GREEN_MAP.set("一年级下册第5课", new Array("野", "猪", "袋", "栽", "锄", "挖", "拱", "筐", "浇"));
GREEN_MAP.set("一年级下册第6课", new Array("特", "饺", "邀", "拥", "抱", "巧", "模", "惹", "端"));
GREEN_MAP.set("一年级下册第7课", new Array("晓", "眠", "啼", "离", "枯", "荣", "烧"));
GREEN_MAP.set("一年级下册第8课", new Array("喝", "渴", "瓶", "怎", "旁", "终", "衔", "颗", "渐"));
GREEN_MAP.set("一年级下册第9课", new Array("咏", "登", "沿", "艰", "爬", "显", "飘", "诵", "赞"));
GREEN_MAP.set("一年级下册第10课", new Array("假", "缸", "掉", "慌", "搬", "使", "劲", "砸", "救"));
GREEN_MAP.set("一年级下册第11课", new Array("彩", "院", "玩", "勇", "然", "却"));
GREEN_MAP.set("一年级下册第12课", new Array("系", "朗", "能", "圈", "温", "度", "淡", "停", "绕"));
GREEN_MAP.set("一年级下册第13课", new Array("旅", "峰", "昨", "带", "聚", "映", "越", "新"));
GREEN_MAP.set("一年级下册第14课", new Array("植", "物", "需", "息", "柄", "展", "叠", "拢", "垂"));
GREEN_MAP.set("一年级下册第15课", new Array("极", "昂", "挺", "胸", "企", "披", "羞", "寂", "寞"));
GREEN_MAP.set("一年级下册第16课", new Array("服", "楼", "灯", "笼", "联"));
GREEN_MAP.set("一年级下册第17课", new Array("久", "岛", "栅", "爱", "熊", "低", "啃", "排", "影", "念"));
GREEN_MAP.set("一年级下册第18课", new Array("毅", "探", "帅", "亲", "病", "赶", "故", "乡", "询", "替"));
GREEN_MAP.set("一年级下册第19课", new Array("邓", "经", "常", "夸", "奖", "识", "帖", "按"));
GREEN_MAP.set("一年级下册第20课", new Array("骑", "赛", "洲", "致", "勃", "摔", "技", "疯", "狂", "献"));
GREEN_MAP.set("一年级下册第21课", new Array("鼠", "灿", "蚯", "蚓", "摘", "留", "奇", "怪", "钻"));
GREEN_MAP.set("一年级下册第22课", new Array("蝈", "运", "粮", "食", "傻", "乘", "刮", "藏", "饿", "神"));
GREEN_MAP.set("一年级下册第23课", new Array("棵", "喂", "远", "摸", "托"));
GREEN_MAP.set("一年级下册第24课", new Array("悯", "盘", "餐", "粒", "皆", "种", "收", "犹"));

//二年级上册
GREEN_MAP.set("二年级上册识字1", new Array("雁", "霜", "游"));
GREEN_MAP.set("二年级上册识字2", new Array("典", "阅", "焰", "腾"));
GREEN_MAP.set("二年级上册识字3", new Array("铅", "腿", "斜", "匹", "粗"));
GREEN_MAP.set("二年级上册识字4", new Array("喵", "瞄", "准", "锚", "爪", "混", "淆"));
GREEN_MAP.set("二年级上册识字5", new Array("蟒", "猬", "绳"));
GREEN_MAP.set("二年级上册识字6", new Array("骏", "椰", "牦"));
GREEN_MAP.set("二年级上册识字7", new Array("侧"));
GREEN_MAP.set("二年级上册识字8", new Array("苞", "咧"));
GREEN_MAP.set("二年级上册第1课", new Array("绵", "稻", "梁", "滚", "逮", "捡", "嗓", "追", "逐"));
GREEN_MAP.set("二年级上册第2课", new Array("疑", "铺", "嗯", "懂", "李"));
GREEN_MAP.set("二年级上册第3课", new Array("曾", "鹂", "盛", "编", "菜", "肚", "串", "馋", "哦", "旷"));
GREEN_MAP.set("二年级上册第4课", new Array("傍", "晖", "慢", "沉", "涨", "染", "紫", "烂"));
GREEN_MAP.set("二年级上册第5课", new Array("盲", "呵", "滋", "领", "淌", "波", "难", "咯"));
GREEN_MAP.set("二年级上册第6课", new Array("玫", "瑰", "掌", "贺"));
GREEN_MAP.set("二年级上册第7课", new Array("胜", "勒", "庐", "笼", "茫"));
GREEN_MAP.set("二年级上册第8课", new Array("鹰", "祝", "试", "鼓", "矮", "喘", "旋"));
GREEN_MAP.set("二年级上册第9课", new Array("期", "湖", "哪", "善", "级", "累", "歇"));
GREEN_MAP.set("二年级上册第10课", new Array("溪", "碴", "脏", "骂", "怜", "啊", "辩"));
GREEN_MAP.set("二年级上册第11课", new Array("狐", "狸", "赔", "漂", "雀", "溜"));
GREEN_MAP.set("二年级上册第12课", new Array("遇", "路", "吗", "俩", "泽", "腰", "参"));
GREEN_MAP.set("二年级上册第13课", new Array("德", "扁", "伍", "冈", "敌", "粉", "储", "陡", "鞋", "戴"));
GREEN_MAP.set("二年级上册第14课", new Array("治", "滔", "洪", "淹", "屋", "遍", "通", "激", "雄"));
GREEN_MAP.set("二年级上册第15课", new Array("援", "附", "震", "贡", "桑", "族", "孤", "恳", "勉", "胞"));
GREEN_MAP.set("二年级上册第16课", new Array("场", "横", "幢", "叽", "忽", "咦", "净", "眯"));
GREEN_MAP.set("二年级上册第17课", new Array("纱", "软", "剥", "瓣", "莹", "透", "籽", "咬", "盏"));
GREEN_MAP.set("二年级上册第18课", new Array("鹳", "欲", "鹿", "柴", "苔"));
GREEN_MAP.set("二年级上册第19课", new Array("秘", "密", "棕", "哗"));
GREEN_MAP.set("二年级上册第20课", new Array("鹤", "遥", "脖", "嵌", "鲜", "逗", "翔", "雅", "滨", "忧"));
GREEN_MAP.set("二年级上册第21课", new Array("唯", "捕", "帮", "蹚", "晃", "搜", "赖", "稀", "暖"));
GREEN_MAP.set("二年级上册第22课", new Array("舞", "活", "巢", "够", "约", "第"));


module.exports = {
  MUST_MAP,GREEN_MAP
}